{
    "interviewCategories": [
      {
        "category": "Experiencia Laboral",
        "questions": [
          {
            "text": "¿En qué compañías has trabajado anteriormente?",
            "note": "Suma si ha trabajado en compañías grandes. Pregunta diseñada para evaluar experiencia previa y contexto laboral."
          },
          {
            "text": "¿Puedes describir tu experiencia en esas compañías?",
            "note": "Permite profundizar en los roles y responsabilidades desempeñados."
          },
          {
            "text": "¿Qué tecnologías utilizaste en tus proyectos anteriores?",
            "note": "Busca entender el dominio técnico del candidato y sus herramientas comunes."
          },
          {
            "text": "¿Has trabajado en equipos distribuidos? ¿Cómo fue esa experiencia?",
            "note": "Explora habilidades de colaboración y comunicación en equipos remotos."
          },
          {
            "text": "¿Tienes experiencia en liderazgo? ¿Puedes dar ejemplos?",
            "note": "Busca identificar capacidades de gestión y liderazgo en proyectos."
          }
        ]
      },
      {
        "category": "Composición de Equipos y Proyectos",
        "questions": [
          {
            "text": "¿Cuál era la composición de los equipos en los que trabajaste?",
            "note": "Proporciona contexto sobre la dinámica de trabajo en equipo."
          },
          {
            "text": "¿Cuál era el tamaño de los proyectos en los que participaste? Cantidad de equipos, personas, cantidad de servicios. Cuantos usuarios tiene la app.",
            "note": "Permite evaluar la complejidad y escala de los proyectos."
          }
        ]
      },
      {
        "category": "Evaluación de Habilidades",
        "questions": [
          {
            "text": "Te voy a dar un problema para que lo resuelvas iterativamente y ver cómo piensas.",
            "note": "Solo para candidatos junior. Diseñado para evaluar habilidades de resolución de problemas y pensamiento lógico."
          }
        ]
      },
      {
        "category": "Microservicios",
        "questions": [
          {
            "text": "¿Qué son los microservicios?",
            "note": "Introduce conocimientos generales sobre arquitectura de software."
          },
          {
            "text": "¿Cuáles son las ventajas y desventajas de los microservicios?",
            "note": "Busca evaluar la comprensión de los pros y contras de esta arquitectura."
          },
          {
            "text": "¿Cómo evitas la repetición de código con los microservicios?",
            "note": "Explora tácticas de diseño para evitar redundancia en sistemas distribuidos."
          }
        ]
      },
      {
        "category": "Comunicación entre APIs",
        "questions": [
          {
            "text": "¿Qué experiencia tienes con App Clients para la comunicación entre APIs, como Nswag?",
            "note": "Evalúa experiencia con herramientas de integración y desarrollo."
          }
        ]
      },
      {
        "category": "Mensajería y Colas",
        "questions": [
          {
            "text": "¿Qué sabes sobre mensajería, colas y service bus?",
            "note": "Explora conocimientos en sistemas de mensajería y su utilidad."
          },
          {
            "text": "¿Para qué sirven?",
            "note": "Refuerza la comprensión del uso práctico de estas herramientas."
          },
          {
            "text": "¿Qué sucede cuando un mensaje no puede ser tomado/enviado o es erróneo?",
            "note": "Evalúa habilidades para manejar errores en sistemas distribuidos. Buscamos que tenga conocimiento de Dead letter queue."
          }
        ]
      },
      {
        "category": "Funciones y Triggers",
        "questions": [
          {
            "text": "¿Por qué usamos funciones?",
            "note": "Introduce el concepto y utilidad de funciones en sistemas. Son eficientes en cuanto al costo y se pueden utilizar porciones de codigo pequenas."
          },
          {
            "text": "¿Qué son los triggers y cómo los utilizas?",
            "note": "Explora conocimiento técnico específico sobre triggers. Scheduled, http, evento."
          },
          {
            "text": "¿Has utilizado alguna vez las funciones de Azure? ¿Puedes explicar cómo se escalan y actualizan?",
            "note": "Evalúa experiencia con herramientas de Azure y conceptos de escalabilidad. Scale in (procesamiento y memoria) and out (cantidad de instancias)."
          }
        ]
      },
      {
        "category": "Swagger/Postman",
        "questions": [
          {
            "text": "¿Qué es Swagger/Postman? ¿Para qué se utilizan?",
            "note": "Busca comprobar el uso de herramientas para documentación y prueba de APIs."
          }
        ]
      },
      {
        "category": "Autorización",
        "questions": [
          {
            "text": "¿Qué sabes sobre JWT? ¿Cuáles son sus partes y cómo se usa para probar una API?",
            "note": "Evalúa conocimientos sobre seguridad y manejo de tokens."
          },
          {
            "text": "¿Qué son los claims en un token?",
            "note": "Busca profundizar en el manejo específico de claims."
          },
          {
            "text": "¿Cómo es el flujo de autorización Oauth?",
            "note": "Explora conocimiento de procesos de autorización modernos."
          }
        ]
      },
      {
        "category": "Base de Datos",
        "questions": [
          {
            "text": "¿Cómo optimizas el performance de las queries?",
            "note": "Evalúa habilidades para mejorar el rendimiento de bases de datos."
          },
          {
            "text": "¿Qué sabes sobre profiler y execution plan?",
            "note": "Explora conocimiento avanzado sobre análisis de rendimiento."
          },
          {
            "text": "¿Qué tipos de índices conoces y cuándo utilizas procedures?",
            "note": "Busca conocer prácticas de optimización en bases de datos."
          },
          {
            "text": "¿Qué problemas has encontrado con Entity Framework (EF)?",
            "note": "Evalúa experiencia práctica y solución de problemas con EF."
          },
          {
            "text": "¿Has utilizado herramientas como Redgate?",
            "note": "Que sepa esto es opcional. Permite evaluar experiencia con herramientas especializadas."
          }
        ]
      },
      {
        "category": "Patrones de Diseño",
        "questions": [
          {
            "text": "¿Qué sabes sobre los patrones Builder, Factory y Singleton?",
            "note": "Explora conocimiento sobre patrones de diseño comunes."
          }
        ]
      },
      {
        "category": "Principios SOLID",
        "questions": [
          {
            "text": "¿Puedes explicar los principios SOLID?",
            "note": "Evalúa comprensión de principios fundamentales de diseño de software."
          }
        ]
      },
      {
        "category": "Recursos de Azure",
        "questions": [
          {
            "text": "¿Qué sabes sobre recursos de Azure, como Key Vault (KV) y App Configuration?",
            "note": "Explora familiaridad con servicios de Azure para gestión de secretos y configuración."
          }
        ]
      },
      {
        "category": "Troubleshooting y Debugging",
        "questions": [
          {
            "text": "¿Cómo realizas troubleshooting en Azure y AppInsights?",
            "note": "Evalúa habilidades para diagnosticar y resolver problemas en entornos de Azure."
          },
          {
            "text": "¿Cómo manejas pull requests (PR) y debugging?",
            "note": "Explora prácticas en gestión de código y depuración."
          }
        ]
      },
      {
        "category": "Inyección de Dependencias",
        "questions": [
          {
            "text": "¿Qué sabes sobre inyección de dependencias? ¿Cuáles son las diferencias entre Singleton, Transient y Scoped?",
            "note": "Evalúa comprensión de patrones de inyección de dependencias y sus alcances."
          }
        ]
      },
      {
        "category": "GraphQL",
        "questions": [
          {
            "text": "¿Qué es GraphQL y para qué sirve?",
            "note": "Es una pregunta opcional. Busca conocer familiaridad con tecnologías modernas de consulta de APIs."
          }
        ]
      },
      {
        "category": "Componentes en React",
        "questions": [
          {
            "text": "¿Puedes explicar cómo funcionan los componentes en React y cómo se utilizan los estados y las propiedades en ellos?",
            "note": "Explora comprensión de la arquitectura de componentes en React."
          }
        ]
      },
      {
        "category": "Manejo de Errores",
        "questions": [
          {
            "text": "¿Cómo manejas los errores en .NET y React? ¿Has utilizado algún sistema de registro de errores?",
            "note": "Evalúa prácticas de manejo de errores y uso de herramientas de logging."
          }
        ]
      },
      {
        "category": "Hooks en React",
        "questions": [
          {
            "text": "¿Puedes explicar cómo se utilizan los hooks en React? ¿Has utilizado el patrón de diseño atómico?",
            "note": "Explora conocimiento sobre hooks y patrones de diseño en React."
          }
        ]
      },
      {
        "category": "Pruebas Unitarias",
        "questions": [
          {
            "text": "¿Has trabajado con pruebas unitarias en .NET o React? ¿Puedes hablar sobre tu experiencia con las pruebas de simulación (mocking)?",
            "note": "Evalúa experiencia en pruebas unitarias y técnicas de mocking."
          }
        ]
      },
      {
        "category": "Pipelines de CI/CD",
        "questions": [
          {
            "text": "¿Has trabajado con pipelines de CI/CD en .NET o React? ¿Puedes hablar sobre tu experiencia con Azure Pipelines o Jenkins?",
            "note": "Explora experiencia en integración y despliegue continuo utilizando herramientas específicas."
          }
        ]
      },
      {
        "category": "Gestión de Estado en React",
        "questions": [
          {
            "text": "¿Puedes hablar sobre tu experiencia con la gestión de estado en React? ¿Has utilizado Redux o Zustand?",
            "note": "Evalúa conocimiento y experiencia en gestión de estado en aplicaciones React."
          }
        ]
      }
    ]
  }